<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //Permissions
        $permissions = [
            'عام',   'تسوق', 'معلومات الانشطه', 'الاعدادت العامه', 'الطلبيات', 'الرئيسيه',




            'لوحة القياده',
            'لوحة القياده للبائع',
            'الصفحه الرئيسيه للبائع',


            'الانشطه',
            'جميع الانشطه',
            'الانشطه الغير مفعله',
            'اضافة نشاط',
            'تعديل نشاط',
            'حذف نشاط',
            'حالة نشاط',




            'التصنيفات',
            'جميع التصنيفات',
            'اضافة تصنيف',
            'تعديل تصنيف',
            'حذف تصنيف',


            'المنتجات',
            'جميع المنتجات',
            'المنتجات الغير مفعله',
            'اضافة منتج',
            'تعديل منتج',
            'حذف منتج',
            'حالة منتج',

            'القسائم',
            'جميع القسائم',
            'اضافة قسيمه',
            'تعديل قسيمه',
            'حذف قسيمه',


            'جميع الطلبيات',
            'عرض الطلبيه',
            'حذف الطلبيه',
            'طباعة الطلبيه',

            'ادارة المستخدم',
            'المشرفون',
            'الصلاحيات',
            'مزودي الخدمه',
            'العملاء',
            'البنرات الاعلانيه',
            'الاداره الماليه', 
            'ادارة الاشتراكات',
            'التقارير و الاستعلامات',
            'الاعدادات',
            'اعدادت الصفحات',
            'اعدادت مزودي الخدمه',

            'المتتجات الخاصه',

        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}